wgy504/ihu/SrcBxxh/l1hd_stm32f2/usart.c
/**********************************************************************************
 * 文件名  ：usart.c
 * 描述    ：usart1 应用函数库          
 * 实验平台：NiRen_STM32min板
 * 硬件连接：TXD(PB9)  -> 外部串口RXD     
 *           RXD(PB10) -> 外部串口TXD      
 *           GND	   -> 外部串口GND 
 * 库版本  ：ST_v3.5
**********************************************************************************/

#include "stm32f2xx.h"
#include "usart.h"	  
	
vu8 SPS_GPRS_R_Buff[SPS_GPRS_REC_MAXLEN];	//串口GPRS数据接收缓冲区 
vu8 SPS_GPRS_R_State=0;					//串口GPRS接收状态
vu16 SPS_GPRS_R_Count=0;					//当前接收数据的字节数
const char *SPS_GPRS_string = "AT+CIPSTART=\"TCP\",\"14.125.48.205\",9015";//IP登录服务器,需要根据自己的IP和端口做修改

vu8 SPS_RFID_R_Buff[SPS_RFID_REC_MAXLEN];	//串口RFID数据接收缓冲区 
vu8 SPS_RFID_R_State=0;					//串口RFID接收状态
vu16 SPS_RFID_R_Count=0;					//当前接收数据的字节数 	  

vu8 SPS_BLE_R_Buff[SPS_BLE_REC_MAXLEN];	//串口BLE数据接收缓冲区 
vu8 SPS_BLE_R_State=0;					//串口BLE接收状态
vu16 SPS_BLE_R_Count=0;					//当前接收数据的字节数 	  

vu8 SPS_SPARE1_R_Buff[SPS_SPARE1_REC_MAXLEN];	//串口SPARE1数据接收缓冲区 
vu8 SPS_SPARE1_R_State=0;					//串口SPARE1接收状态
vu16 SPS_SPARE1_R_Count=0;					//当前接收数据的字节数 	  


/*******************************************************************************
* 函数名  : USART_GPRS_Init_Config
* 描述    : USART_GPRS初始化配置
* 输入    : bound：波特率(常用：2400、4800、9600、19200、38400、115200等)
* 输出    : 无
* 返回    : 无 
* 说明    : 无
*******************************************************************************/
void SPS_GPRS_Init_Config(u32 bound)
{
  GPIO_InitTypeDef  GPIO_InitStructure;
	USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef  NVIC_InitStructure;
	
	/*使能USART_GPRS和GPIO外设时钟*/  
	USART_GPRS_TX_ENABLE();
	USART_GPRS_RX_ENABLE();
	USART_GPRS_CLK_ENABLE();
	
	/*复位串口GPRS*/
 	USART_DeInit(USART_GPRS);  
	
	/*USART_GPRS_GPIO初始化设置*/ 
	GPIO_PinAFConfig(USART_GPRS_TX_GPIO_PORT, USART_GPRS_TX_SOURCE, USART_GPRS_TX_AF);
	GPIO_PinAFConfig(USART_GPRS_RX_GPIO_PORT, USART_GPRS_RX_SOURCE, USART_GPRS_RX_AF);
	GPIO_InitStructure.GPIO_Pin = USART_GPRS_TX_GPIO_PIN;			//USART_GPRS_TXD(PA.9)     
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;		//复用推挽输出
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;	//设置引脚输出最大速率为50MHz
	GPIO_Init(USART_GPRS_TX_GPIO_PORT, &GPIO_InitStructure);				 //调用库函数中的GPIO初始化函数，初始化USART_GPRS_TXD(PA.9)  
 
	GPIO_InitStructure.GPIO_Pin = USART_GPRS_RX_GPIO_PIN;	 			//USART_GPRS_RXD(PA.10)
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;	  //浮空输入
	GPIO_Init(USART_GPRS_RX_GPIO_PORT, &GPIO_InitStructure);					//调用库函数中的GPIO初始化函数，初始化USART_GPRS_RXD(PA.10)

  /*USART_GPRS 初始化设置*/
	USART_InitStructure.USART_BaudRate = bound;										//设置波特率
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;						//8位数据格式
	USART_InitStructure.USART_StopBits = USART_StopBits_1;							//1个停止位
	USART_InitStructure.USART_Parity = USART_Parity_No;								//无奇偶校验位
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;	//无硬件数据流控制
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;					//工作模式设置为收发模式
	USART_Init(USART_GPRS, &USART_InitStructure);										//初始化串口1

  /*USART_GPRS NVIC配置*/
  NVIC_InitStructure.NVIC_IRQChannel = USART_GPRS_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority=1;	//抢占优先级3
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;		//从优先级3
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;			//IRQ通道使能
	NVIC_Init(&NVIC_InitStructure);							//根据指定的参数初始化VIC寄存器 
	  
  USART_ITConfig(USART_GPRS, USART_IT_RXNE, ENABLE);			//使能串口1接收中断

  USART_Cmd(USART_GPRS, ENABLE);                    			//使能串口 
	USART_ClearFlag(USART_GPRS, USART_FLAG_TC);					//清除发送完成标志
}


/*******************************************************************************
* 函数名  : USART_SendData
* 描述    : USART_GPRS发送数据缓冲区数据
* 输入    : *buff：数据缓冲区指针，len：发送数据长度
* 输出    : 无
* 返回    : 无 
* 说明    : 无
*******************************************************************************/
void SPS_GPRS_SendData(vs8* buff, u16 len)
{    
	u16 i;

	for(i=0; i<len; i++)  
	{
		while(USART_GetFlagStatus(USART_GPRS, USART_FLAG_TC)==RESET); 
	    USART_SendData(USART_GPRS ,buff[i]);   
	}
}

/*******************************************************************************
* 函数名  : USART_GPRS_IRQHandler
* 描述    : 串口1中断服务程序
* 输入    : 无
* 返回    : 无 
* 说明    : 1)、只启动了USART_GPRS中断接收，未启动USART_GPRS中断发送。
*           2)、接收到0x0d 0x0a(回车、"\r\n")代表帧数据接收完成
*******************************************************************************/
void SPS_GPRS_IRQHandler(void)                	
{
	u8 Res=0;

	if(USART_GetITStatus(USART_GPRS, USART_IT_RXNE) != RESET) //接收中断(接收到的数据必须是0x0d 0x0a结尾)
	{
		Res =USART_ReceiveData(USART_GPRS); //读取接收到的数据(USART_GPRS->DR)
		
		SPS_GPRS_R_Buff[SPS_GPRS_R_Count++] = Res;
		if(SPS_GPRS_R_State == 0)//数据接收未完成
		{
			if(Res == 0x0d)//接收到0x0d,下一个字节接收到0x0a则接收完成
			{
				SPS_GPRS_R_State =2;
			}
		}
		else if(SPS_GPRS_R_State == 2)
		{
			if(Res == 0x0a)//上一个字节接收到0x0d,这个字节接收到0xoa则接收完成
			{
				SPS_GPRS_R_State =1;//数据接收完成
			}
			else//接收错误
			{
				SPS_GPRS_R_State =0;
				SPS_GPRS_R_Count =0;
			}
		}
		if(SPS_GPRS_R_Count >= SPS_GPRS_REC_MAXLEN)//接收数据长度走出接收数据缓冲区
		{
			if((SPS_GPRS_R_Buff[SPS_GPRS_REC_MAXLEN-2] != 0x0d) || (SPS_GPRS_R_Buff[SPS_GPRS_REC_MAXLEN-1] != 0x0a))
			{
				SPS_GPRS_R_Count =0;
				SPS_GPRS_R_State =0;
			}
		} 		 
	} 
} 	

/*******************************************************************************
* 函数名 : CLR_Buf2
* 描述   : 清除串口2缓存数据
* 输入   : 
* 输出   : 
* 返回   : 
* 注意   : 
*******************************************************************************/
void SPS_GPRS_clear_receive_buffer(void)
{
	u16 k;
	for(k=0;k<SPS_GPRS_REC_MAXLEN;k++)      //将缓存内容清零
	{
		SPS_GPRS_R_Buff[k] = 0x00;
	}
  SPS_GPRS_R_Count = 0;               //接收字符串的起始存储位置
}

/*******************************************************************************
* 函数名 : Find
* 描述   : 判断缓存中是否含有指定的字符串
* 输入   : 
* 输出   : 
* 返回   : unsigned char:1 找到指定字符，0 未找到指定字符 
* 注意   : 
*******************************************************************************/
u8 SPS_GPRS_Find_char(char *a)
{ 
  if(strstr((char *)SPS_GPRS_R_Buff, a)!=NULL)
	    return 1;
	else
			return 0;
}

