wgy504/ihu/SrcBxxh/l1hd_stm32f2/usart.c
/*******************************************************************************
* 函数名 : GSM_send_cmd
* 描述   : 发送AT指令函数
* 输入   : 发送数据的指针、发送等待时间(单位：ms)
* 输出   : 
* 返回   : 0:正常  1:错误
* 注意   : 
*******************************************************************************/
u8 SPS_GPRS_send_AT_command(char *cmd, char *ack, u16 wait_time)   //in ms      
{
	u8 res=1;
	SPS_GPRS_clear_receive_buffer(); 
	for (; *cmd!='\0';cmd++)
	{
		while(USART_GetFlagStatus(USART_GPRS, USART_FLAG_TC)==RESET);
	  USART_SendData(USART_GPRS,*cmd);
	}
	SPS_GPRS_SendLR();	
	ihu_sleep(wait_time);
	if(strstr((const char*)SPS_GPRS_R_Buff,(char*)ack)==NULL)
		 res=1;
	else res=0;

	return res;
}

/*******************************************************************************
* 函数名  : USART_GPRS_SendString
* 描述    : USART_GPRS发送字符串
* 输入    : *s字符串指针
* 输出    : 无
* 返回    : 无 
* 说明    : 无
*******************************************************************************/
void SPS_GPRS_SendString(char* s)
{
	while(*s != '\0')//检测字符串结束符
	{
		while(USART_GetFlagStatus(USART_GPRS, USART_FLAG_TC)==RESET); 
		USART_SendData(USART_GPRS ,*s++);//发送当前字符
	}
}

/*******************************************************************************
* 函数名 : Wait_CREG
* 描述   : 等待模块注册成功
* 输入   : 
* 输出   : 
* 返回   : 
* 注意   : 
*******************************************************************************/
void SPS_GPRS_Wait_CREG(void)
{
	u8 i;
	u8 k;
	i = 0;
  while(i == 0)        			
	{
		SPS_GPRS_clear_receive_buffer();        
		SPS_GPRS_SendString("AT+CREG?");   //查询等待模块注册成功
		SPS_GPRS_SendLR();
		ihu_sleep(500);  //等待500ms
		for(k=0;k<SPS_GPRS_REC_MAXLEN;k++)      			
		{
			if(SPS_GPRS_R_Buff[k] == ':')
			{
				if((SPS_GPRS_R_Buff[k+4] == '1')||(SPS_GPRS_R_Buff[k+4] == '5'))   //说明注册成功
				{
					i = 1;
					IhuDebugPrint("\r");
					break;
				}
			}
		}
		IhuDebugPrint("VMUO: Under Registering.....");  //注册中。。。
	}
}

/*******************************************************************************
* 函数名 : Set_ATE0
* 描述   : 取消回显
* 输入   : 
* 输出   : 
* 返回   : 
* 注意   : 
*******************************************************************************/
void SPS_GPRS_Set_ATE0(void)
{
	SPS_GPRS_send_AT_command("ATE0", "OK", 500);								//取消回显		
}

/*******************************************************************************
* 函数名 : Connect_Server
* 描述   : GPRS连接服务器函数
* 输入   : 
* 输出   : 
* 返回   : 
* 注意   : 
*******************************************************************************/
void SPS_GPRS_connect_server(void)
{
	SPS_GPRS_clear_receive_buffer();
	SPS_GPRS_SendString("AT+CIPCLOSE=1");	//关闭连接
  ihu_sleep(100);
	SPS_GPRS_send_AT_command("AT+CIPSHUT","SHUT OK", 500);		//关闭移动场景
	SPS_GPRS_send_AT_command("AT+CGCLASS=\"B\"","OK", 500);//设置GPRS移动台类别为B,支持包交换和数据交换 
	SPS_GPRS_send_AT_command("AT+CGDCONT=1,\"IP\",\"CMNET\"","OK", 500);//设置PDP上下文,互联网接协议,接入点等信息
	SPS_GPRS_send_AT_command("AT+CGATT=1","OK", 500);//附着GPRS业务
	SPS_GPRS_send_AT_command("AT+CIPCSGP=1,\"CMNET\"","OK", 500);//设置为GPRS连接模式
  SPS_GPRS_send_AT_command("AT+CIPMUX=0","OK", 500);//设置为单路连接
	SPS_GPRS_send_AT_command("AT+CIPHEAD=1","OK", 500);//设置接收数据显示IP头(方便判断数据来源,仅在单路连接有效)
	SPS_GPRS_send_AT_command("AT+CIPMODE=1","OK", 500);//打开透传功能
	SPS_GPRS_send_AT_command("AT+CIPCCFG=4,5,200,1","OK", 500);//配置透传模式：单包重发次数:2,间隔1S发送一次,每次发送200的字节
  SPS_GPRS_send_AT_command((char *)SPS_GPRS_string, "OK", 2000);//建立连接
  
  ihu_sleep(100);                                //等待串口数据接收完毕
  SPS_GPRS_clear_receive_buffer();                                    //清串口接收缓存为透传模式准备
}

/*******************************************************************************
* 函数名 : Rec_Server_Data
* 描述   : 接收服务器数据函数,并原样返回
* 输入   : 
* 输出   : 
* 返回   : 
* 注意   : 
*******************************************************************************/
void SPS_GPRS_Rec_Server_Data(void)
{
//p2指向发送数据，p1指向接收数据，这里可以使用SPS_GPRS_R_Count来判断
//	if(p2!=p1)   		//说明还有数据未发出
//	{	
//		while(USART_GetFlagStatus(USART_GPRS, USART_FLAG_TC)==RESET);
//		SPS_GPRS_SendData(USART_GPRS, *p2);
//		p2++;
//    if(p2>&SPS_GPRS_R_Buff[SPS_GPRS_REC_MAXLEN])
//			p2=SPS_GPRS_R_Buff;
//	}
}

//一个完整的数据流程，且不断回送数据
void SPS_GPRS_data_connection_and_receive_process(void)
{
	IhuDebugPrint("VMUO: GPRS Module GPRS register network!\n");
	SPS_GPRS_SendString("+++");//退出透传模式，避免模块还处于透传模式中
  ihu_usleep(500);  //500ms
	SPS_GPRS_Wait_CREG();   //等待模块注册成功
	IhuDebugPrint("VMUO: GPRS Register Success!\n");
	IhuDebugPrint("VMUO: GPRS Module connect server!\n");
	SPS_GPRS_Set_ATE0();    //取消回显
	SPS_GPRS_connect_server(); //设置GPRS参数
	IhuDebugPrint("VMUO: Connect success!\n");

//	while(1)
//	{
//		Rec_Server_Data();//接收数据并原样返回	
//	}


}










/*******************************************************************************
* 函数名  : USART_RFID_Init_Config
* 描述    : USART_RFID初始化配置
* 输入    : bound：波特率(常用：2400、4800、9600、19200、38400、115200等)
* 输出    : 无
* 返回    : 无 
* 说明    : 无
*******************************************************************************/
void SPS_RFID_Init_Config(u32 bound)
{
  GPIO_InitTypeDef  GPIO_InitStructure;
	USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef  NVIC_InitStructure;
	
	/*使能USART_RFID和GPIO外设时钟*/  
	USART_RFID_TX_ENABLE();
	USART_RFID_RX_ENABLE();
	USART_RFID_CLK_ENABLE();
	
	/*复位串口RFID*/
 	USART_DeInit(USART_RFID);  
	
	/*USART_RFID_GPIO初始化设置*/ 
	GPIO_PinAFConfig(USART_RFID_TX_GPIO_PORT, USART_RFID_TX_SOURCE, USART_RFID_TX_AF);
	GPIO_PinAFConfig(USART_RFID_RX_GPIO_PORT, USART_RFID_RX_SOURCE, USART_RFID_RX_AF);
	GPIO_InitStructure.GPIO_Pin = USART_RFID_TX_GPIO_PIN;			//USART_RFID_TXD(PA.9)     
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;		//复用推挽输出
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;	//设置引脚输出最大速率为50MHz
	GPIO_Init(USART_RFID_TX_GPIO_PORT, &GPIO_InitStructure);				 //调用库函数中的GPIO初始化函数，初始化USART_RFID_TXD(PA.9)  
 
	GPIO_InitStructure.GPIO_Pin = USART_RFID_RX_GPIO_PIN;	 			//USART_RFID_RXD(PA.10)
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;	  //浮空输入
	GPIO_Init(USART_RFID_RX_GPIO_PORT, &GPIO_InitStructure);					//调用库函数中的GPIO初始化函数，初始化USART_RFID_RXD(PA.10)

  /*USART_RFID 初始化设置*/
	USART_InitStructure.USART_BaudRate = bound;										//设置波特率
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;						//8位数据格式
	USART_InitStructure.USART_StopBits = USART_StopBits_1;							//1个停止位
	USART_InitStructure.USART_Parity = USART_Parity_No;								//无奇偶校验位
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;	//无硬件数据流控制
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;					//工作模式设置为收发模式
	USART_Init(USART_RFID, &USART_InitStructure);										//初始化串口1

