wgy504/ihu/SrcBxxh/l1hd_stm32f2/usart.c
/*******************************************************************************
* 函数名  : UART_SPARE1_Init_Config
* 描述    : UART_SPARE1初始化配置
* 输入    : bound：波特率(常用：2400、4800、9600、19200、38400、115200等)
* 输出    : 无
* 返回    : 无 
* 说明    : 无
*******************************************************************************/
void SPS_SPARE1_Init_Config(u32 bound)
{
  GPIO_InitTypeDef  GPIO_InitStructure;
	USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef  NVIC_InitStructure;
	
	/*使能UART_SPARE1和GPIO外设时钟*/  
	UART_SPARE1_TX_ENABLE();
	UART_SPARE1_RX_ENABLE();
	UART_SPARE1_CLK_ENABLE();
	
	/*复位串口SPARE1*/
 	USART_DeInit(UART_SPARE1);  
	
	/*UART_SPARE1_GPIO初始化设置*/ 
	GPIO_PinAFConfig(UART_SPARE1_TX_GPIO_PORT, UART_SPARE1_TX_SOURCE, UART_SPARE1_TX_AF);
	GPIO_PinAFConfig(UART_SPARE1_RX_GPIO_PORT, UART_SPARE1_RX_SOURCE, UART_SPARE1_RX_AF);
	GPIO_InitStructure.GPIO_Pin = UART_SPARE1_TX_GPIO_PIN;			//UART_SPARE1_TXD(PA.9)     
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;		//复用推挽输出
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;	//设置引脚输出最大速率为50MHz
	GPIO_Init(UART_SPARE1_TX_GPIO_PORT, &GPIO_InitStructure);				 //调用库函数中的GPIO初始化函数，初始化UART_SPARE1_TXD(PA.9)  
 
	GPIO_InitStructure.GPIO_Pin = UART_SPARE1_RX_GPIO_PIN;	 			//UART_SPARE1_RXD(PA.10)
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;	  //浮空输入
	GPIO_Init(UART_SPARE1_RX_GPIO_PORT, &GPIO_InitStructure);					//调用库函数中的GPIO初始化函数，初始化UART_SPARE1_RXD(PA.10)

  /*UART_SPARE1 初始化设置*/
	USART_InitStructure.USART_BaudRate = bound;										//设置波特率
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;						//8位数据格式
	USART_InitStructure.USART_StopBits = USART_StopBits_1;							//1个停止位
	USART_InitStructure.USART_Parity = USART_Parity_No;								//无奇偶校验位
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;	//无硬件数据流控制
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;					//工作模式设置为收发模式
	USART_Init(UART_SPARE1, &USART_InitStructure);										//初始化串口1

  /*UART_SPARE1 NVIC配置*/
  NVIC_InitStructure.NVIC_IRQChannel = UART_SPARE1_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority=1;	//抢占优先级3
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;		//从优先级3
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;			//IRQ通道使能
	NVIC_Init(&NVIC_InitStructure);							//根据指定的参数初始化VIC寄存器 
	  
  USART_ITConfig(UART_SPARE1, USART_IT_RXNE, ENABLE);			//使能串口1接收中断

  USART_Cmd(UART_SPARE1, ENABLE);                    			//使能串口 
	USART_ClearFlag(UART_SPARE1, USART_FLAG_TC);					//清除发送完成标志
}


/*******************************************************************************
* 函数名  : USART_SendData
* 描述    : UART_SPARE1发送数据缓冲区数据
* 输入    : *buff：数据缓冲区指针，len：发送数据长度
* 输出    : 无
* 返回    : 无 
* 说明    : 无
*******************************************************************************/
void SPS_SPARE1_SendData(vs8* buff, u16 len)
{    
	u16 i;

	for(i=0; i<len; i++)  
	{
		while(USART_GetFlagStatus(UART_SPARE1, USART_FLAG_TC)==RESET); 
	    USART_SendData(UART_SPARE1 ,buff[i]);   
	}
}

/*******************************************************************************
* 函数名  : UART_SPARE1_IRQHandler
* 描述    : 串口1中断服务程序
* 输入    : 无
* 返回    : 无 
* 说明    : 1)、只启动了UART_SPARE1中断接收，未启动UART_SPARE1中断发送。
*           2)、接收到0x0d 0x0a(回车、"\r\n")代表帧数据接收完成
*******************************************************************************/
void SPS_SPARE1_IRQHandler(void)                	
{
	u8 Res=0;

	if(USART_GetITStatus(UART_SPARE1, USART_IT_RXNE) != RESET) //接收中断(接收到的数据必须是0x0d 0x0a结尾)
	{
		Res =USART_ReceiveData(UART_SPARE1); //读取接收到的数据(UART_SPARE1->DR)
		
		SPS_SPARE1_R_Buff[SPS_SPARE1_R_Count++] = Res;
		if(SPS_SPARE1_R_State == 0)//数据接收未完成
		{
			if(Res == 0x0d)//接收到0x0d,下一个字节接收到0x0a则接收完成
			{
				SPS_SPARE1_R_State =2;
			}
		}
		else if(SPS_SPARE1_R_State == 2)
		{
			if(Res == 0x0a)//上一个字节接收到0x0d,这个字节接收到oxoa则接收完成
			{
				SPS_SPARE1_R_State =1;//数据接收完成
			}
			else//接收错误
			{
				SPS_SPARE1_R_State =0;
				SPS_SPARE1_R_Count =0;
			}
		}
		if(SPS_SPARE1_R_Count >= SPS_SPARE1_REC_MAXLEN)//接收数据长度走出接收数据缓冲区
		{
			if((SPS_SPARE1_R_Buff[SPS_SPARE1_REC_MAXLEN-2] != 0x0d) || (SPS_SPARE1_R_Buff[SPS_SPARE1_REC_MAXLEN-1] != 0x0a))
			{
				SPS_SPARE1_R_Count =0;
				SPS_SPARE1_R_State =0;
			}
		} 		 
	} 
}

/***********************************************************************/
/*************************----- 串口重定向 -----************************/
/***********************************************************************/
#pragma import(__use_no_semihosting)             
//标准库需要的支持函数                 
struct __FILE 
{ 
	int handle; 
	/* Whatever you require here. If the only file you are using is */ 
	/* standard output using printf() for debugging, no file handling */ 
	/* is required. */ 
}; 
/* FILE is typedef’ d in stdio.h. */ 
FILE __stdout;       
//定义_sys_exit()以避免使用半主机模式    
_sys_exit(int x) 
{ 
	x = x; 
} 

/*******************************************************************************
* 函数名  : fputc
* 描述    : 重定义putc函数
* 输入    : 无
* 返回    : 无 
* 说明    : 重定义putc函数，这样可以使用printf函数从串口1打印输出
*******************************************************************************/
int sps_fputc(int ch, FILE *f)
{
 /* e.g. 给USART写一个字符 */
 USART_SendData(USART_GPRS, (uint8_t) ch);

 /* 循环直到发送完成 */
 while (USART_GetFlagStatus(USART_GPRS, USART_FLAG_TC) == RESET);

 return ch;
}

/*******************************************************************************
* 函数名  : fgetc
* 描述    : 重定义getc函数
* 输入    : 无
* 返回    : 无 
* 说明    : 重定义getc函数，这样可以使用scanff函数从串口1输入数据
*******************************************************************************/
int sps_fgetc(FILE *f)
{
 /* 等待串口1输入数据 */
 while (USART_GetFlagStatus(USART_GPRS, USART_FLAG_RXNE) == RESET);

 return (int)USART_ReceiveData(USART_GPRS);
}	





